#include "reg52.h"
#define uchar unsigned char    
#define uint unsigned int
sbit buzz=P2^2;//蜂鸣器
sbit key1=P2^7;//按键
bit start;    //报警触发的变量
uchar num;    //21个音的计数
uint timer,index=0;   //定时器初值,数据表索引
uchar beat;   //节拍数
//《孤勇者》数据表
code uchar gequ[]={120,116,117,211,212,117,211,221,
211,117,211,212,117,211,221,211,212,213,212,213,212,223,
213,212,223,225,223,116,117,211,212,117,211,221,211,117,
211,212,117,211,221,211,212,213,212,213,212,223,213,212,
223,225,223,225,233,215,233,215,213,215,216,213,225,225,
233,215,233,215,213,215,216,213,225,215,215,213,212,222,
222,211,213,213,212,222,222,211,211,146,110,215,215,213,
212,222,222,211,213,213,212,222,222,211,211,146,140,0};
//频率表
code uint pinlv[]={466,523,587,659,698,784,880,//低音
	                932,1047,1175,1319,1397,1568,1760,//中音
                  1865,2094,2351,2633,2792,3134,3517};//高音
void delay (uchar t);
void play();
void main()
{
	buzz=1;
	TMOD=0x01;
	EA=1;
	ET0=1;
	while(1)
	{
			play();
	}		
}
void timer0() interrupt 1
{
	TH0=timer/256;
	TL0=timer%256;	
	buzz=~buzz;
}

void delay(uchar t)
{
	uint i,j;
	for(i=t;i>0;i--)
		for(j=23000;j>0;j--);
}

void play()
{
	while(gequ[index])    //声音数据索引不为零即没到结束就执行下面
	{
		if(gequ[index]%10==0)  //如果根据数据分离出的音符是0，表示不发声
			TR0=0;               // 比如120         
		else	
		{
			num=gequ[index]%10+(gequ[index]/100-1)*7-1;//根据数据索引计算频率索引
			timer=65536-(11059200/12)/(pinlv[num]*2);//根据频率计算初值
			TH0=timer/256;
			TL0=timer%256;	
			TR0=1;	
		}				
		beat=gequ[index]/10%10;  //根据数据分离出节拍数
		delay(beat);
		index++;             //声音数据索引自动加1			
	}
	TR0=0;           //播放结束停定时器
	index=0;        //播放结束声音数据索引清零
}

